package video;

import java.util.Date;

public class TableOneNote {
    Integer numRow;
    String block;
    Date startTimeYoutube;
    Date startTimeCorner;
    String description;

    // Файл - "/Users/yaroslav/Downloads/Video/ФУБ_Виктор/2020-06-30 Виктор 3_3часть модуль НЛП практик - SCORE - TOTE - Якоря/2020-06-30 Виктор.srt"

    //методы
    //  считать из OneNote  (как бы предварительно не пришлось сохранять в Excel для обработки)
    //  ? в какую структуру данных? - можно в TreeMap
    //  сохранить в БД?

    //  далее нарезка по стартовому времени YouTube с субтитрами - и здесь основная работа
    //  там нужны отсечки по времени YouTube

    //  Хорошо бы текст из SRT получить в виде оформленных предложений.... (чтобы не сплошным текстом)
    //  Можно ли получить ключевые слова из текста (этого блока) - частотную статистику слов?


    //  Вначале метод - получить субитры в диапазоне
    //  как по времени >= start  и <end
    //  00:24:19 до 00:26:09 -
    //  вывести в консоль
    //  скопировать в буфер обмена (для вставки)


    //  так и по номерам комментариев? - нужно как промежуточный пункт ...
}
